/**********************************Copyright (c)**********************************
**                       版权所有 (C), 2015-2030, 涂鸦科技
**
**                             http://www.tuya.com
**
*********************************************************************************
 * @file    cellular.h
 * @author  涂鸦综合协议开发组
 * @version v1.0.0
 * @date    2020.12.25
 * @brief   用户无需关心该文件实现内容
 *
**--------------当前版本修订---------------------------------------------------

** 版  本: v1.0.2
** 日　期: 2021年1月13日
** 描　述: 1:支持GNSS和WIFI的定位协议

**
**-----------------------------------------------------------------------------

****************************** 免责声明 ！！！ *******************************
由于MCU类型和编译环境多种多样，所以此代码仅供参考，用户请自行把控最终代码质量，
涂鸦不对MCU功能结果负责。
******************************************************************************/

#ifndef __CELLULAR_H_
#define __CELLULAR_H_

#include "stdio.h"
#include "string.h"
#include "protocol.h"
#include "system.h"
#include "mcu_api.h"
#include "tuya_type.h"


//=============================================================================
//定义常量
//=============================================================================
#ifndef TRUE
#define      TRUE                1
#endif

#ifndef FALSE
#define         FALSE            0
#endif

#ifndef NULL
#define         NULL             ((void *) 0)
#endif

#ifndef SUCCESS
#define         SUCCESS          1
#endif

#ifndef ERROR
#define         ERROR            0
#endif

#ifndef INVALID
#define         INVALID          0xFF
#endif

#ifndef ENABLE
#define         ENABLE           1
#endif

#ifndef DISABLE
#define         DISABLE          0
#endif
//=============================================================================
//dp数据点类型
//=============================================================================
#define         DP_TYPE_RAW                     0x00        //RAW 类型
#define         DP_TYPE_BOOL                    0x01        //bool 类型
#define         DP_TYPE_VALUE                   0x02        //value 类型
#define         DP_TYPE_STRING                  0x03        //string 类型
#define         DP_TYPE_ENUM                    0x04        //enum 类型
#define         DP_TYPE_BITMAP                  0x05        //fault 类型

//=============================================================================
//蜂窝设备工作状态
//=============================================================================
#define         NO_SIM                          0x00                //SIM卡未连接
#define         SEARCH_NETWORK                  0x01                //搜索网络中
#define         LOGINED_DISCONNECTED            0x02                //已成功注册未联网
#define         CONNECTED_GET_IP                0x03                //联网成功并获取到IP
#define         CONNECTED_CLOUD                 0x04                //已连接到云端
#define         CELLULAR_SATE_UNKNOW             0xff                //未知状态

//=============================================================================
//蜂窝设备复位状态
//=============================================================================
#define         RESET_CELLULAR_ERROR                0
#define         RESET_CELLULAR_SUCCESS              1

//=============================================================================
//蜂窝设备配置复位状态
//=============================================================================
#define         SET_CELLULARCONFIG_ERROR            0
#define         SET_CELLULARCONFIG_SUCCESS          1

//=============================================================================
//MCU固件升级状态
//=============================================================================
#define         FIRM_STATE_UN_SUPPORT           0x00                            //不支持 MCU 升级
#define         FIRM_STATE_CELLUAR_UN_READY        0x01                         //模块未就绪
#define         FIRM_STATE_GET_ERROR            0x02                            //云端升级信息查询失败
#define         FIRM_STATE_NO                   0x03                            //无需升级（云端无更新版本）
#define         FIRM_STATE_START                0x04                            //需升级，等待模块发起升级操作

//=============================================================================
//蜂窝设备和mcu的工作方式
//=============================================================================
#define         UNION_WORK                      0x0                             //mcu模块与蜂窝配合处理
#define         CELLUAR_ALONE                   0x1                             //蜂窝模块自处理

//=============================================================================
//系统工作模式
//=============================================================================
#define         NORMAL_MODE                     0x00                            //正常工作状态
#define         FACTORY_MODE                    0x01                            //工厂模式
#define         UPDATE_MODE                     0x02                            //升级模式

//=============================================================================
//功耗方式选择
//=============================================================================
#define         CONFIG_MODE_DEFAULT             "0"                             //正常功耗
#define         CONFIG_MODE_LOWPOWER            "1"                             //低功耗




//=============================================================================
//下发命令
//=============================================================================
typedef struct {
  u8 dp_id;                              //dp序号
  u8 dp_type;                            //dp类型
} DOWNLOAD_CMD_S;

#endif
